VMs/Results/Suricata/Fio/results_1.txt
hostname=server, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.28, flags=1
<server> write.test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<server> ...
<server> Starting 4 processes
<server> 
write.test: (groupid=0, jobs=1): err= 0: pid=43824: Tue Dec 10 18:03:45 2024
  read: IOPS=1498, BW=5996KiB/s (6140kB/s)(1757MiB/300001msec)
    slat (usec): min=10, max=15869, avg=220.04, stdev=491.70
    clat (usec): min=3, max=13588, avg=359.28, stdev=508.14
     lat (usec): min=16, max=15928, avg=627.93, stdev=737.80
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    7], 20.00th=[   10],
     | 30.00th=[   24], 40.00th=[  269], 50.00th=[  306], 60.00th=[  338],
     | 70.00th=[  383], 80.00th=[  469], 90.00th=[  685], 95.00th=[ 1012],
     | 99.00th=[ 2573], 99.50th=[ 3425], 99.90th=[ 5604], 99.95th=[ 6587],
     | 99.99th=[ 8717]
   bw (  KiB/s): min= 2711, max= 9474, per=25.19%, avg=6004.41, stdev=1233.86, samples=599
   iops        : min=  677, max= 2368, avg=1500.90, stdev=308.47, samples=599
  lat (usec)   : 4=0.11%, 10=20.78%, 20=8.32%, 50=1.83%, 100=0.72%
  lat (usec)   : 250=2.95%, 500=47.28%, 750=9.64%, 1000=3.30%
  lat (msec)   : 2=3.41%, 4=1.34%, 10=0.33%, 20=0.01%
  cpu          : usr=5.22%, sys=34.10%, ctx=518117, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=449683,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43825: Tue Dec 10 18:03:45 2024
  read: IOPS=1491, BW=5967KiB/s (6111kB/s)(1748MiB/300001msec)
    slat (usec): min=10, max=13206, avg=219.71, stdev=493.13
    clat (usec): min=3, max=15668, avg=361.06, stdev=510.12
     lat (usec): min=16, max=20630, avg=630.16, stdev=744.77
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   29], 40.00th=[  273], 50.00th=[  306], 60.00th=[  338],
     | 70.00th=[  383], 80.00th=[  474], 90.00th=[  693], 95.00th=[ 1012],
     | 99.00th=[ 2573], 99.50th=[ 3458], 99.90th=[ 5604], 99.95th=[ 6652],
     | 99.99th=[ 8717]
   bw (  KiB/s): min= 2770, max= 9160, per=25.07%, avg=5976.36, stdev=1243.21, samples=599
   iops        : min=  692, max= 2290, avg=1493.89, stdev=310.79, samples=599
  lat (usec)   : 4=0.08%, 10=20.04%, 20=8.63%, 50=1.94%, 100=0.77%
  lat (usec)   : 250=2.97%, 500=47.32%, 750=9.71%, 1000=3.43%
  lat (msec)   : 2=3.42%, 4=1.36%, 10=0.32%, 20=0.01%
  cpu          : usr=5.35%, sys=33.89%, ctx=514476, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=447558,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43826: Tue Dec 10 18:03:45 2024
  read: IOPS=1480, BW=5923KiB/s (6065kB/s)(1735MiB/300001msec)
    slat (usec): min=11, max=13200, avg=220.19, stdev=493.57
    clat (usec): min=3, max=12696, avg=363.67, stdev=514.70
     lat (usec): min=16, max=17125, avg=634.95, stdev=748.45
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   29], 40.00th=[  269], 50.00th=[  306], 60.00th=[  338],
     | 70.00th=[  383], 80.00th=[  478], 90.00th=[  701], 95.00th=[ 1029],
     | 99.00th=[ 2606], 99.50th=[ 3523], 99.90th=[ 5604], 99.95th=[ 6521],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 2701, max= 9803, per=24.86%, avg=5926.03, stdev=1301.30, samples=599
   iops        : min=  675, max= 2450, avg=1481.31, stdev=325.31, samples=599
  lat (usec)   : 4=0.05%, 10=19.75%, 20=8.90%, 50=2.01%, 100=0.83%
  lat (usec)   : 250=3.02%, 500=46.87%, 750=9.92%, 1000=3.45%
  lat (msec)   : 2=3.47%, 4=1.39%, 10=0.34%, 20=0.01%
  cpu          : usr=5.24%, sys=33.86%, ctx=512385, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=444193,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43827: Tue Dec 10 18:03:45 2024
  read: IOPS=1487, BW=5950KiB/s (6093kB/s)(1743MiB/300001msec)
    slat (usec): min=11, max=18692, avg=224.85, stdev=504.25
    clat (usec): min=3, max=12947, avg=359.01, stdev=504.91
     lat (usec): min=16, max=24007, avg=632.56, stdev=742.88
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   25], 40.00th=[  273], 50.00th=[  306], 60.00th=[  338],
     | 70.00th=[  383], 80.00th=[  474], 90.00th=[  685], 95.00th=[  996],
     | 99.00th=[ 2540], 99.50th=[ 3425], 99.90th=[ 5473], 99.95th=[ 6456],
     | 99.99th=[ 8848]
   bw (  KiB/s): min= 2240, max= 9808, per=24.98%, avg=5953.41, stdev=1234.83, samples=599
   iops        : min=  560, max= 2452, avg=1488.14, stdev=308.70, samples=599
  lat (usec)   : 4=0.09%, 10=20.28%, 20=8.82%, 50=1.68%, 100=0.79%
  lat (usec)   : 250=2.73%, 500=47.43%, 750=9.77%, 1000=3.46%
  lat (msec)   : 2=3.32%, 4=1.32%, 10=0.32%, 20=0.01%
  cpu          : usr=5.26%, sys=34.06%, ctx=514021, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=446242,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=23.3MiB/s (24.4MB/s), 5923KiB/s-5996KiB/s (6065kB/s-6140kB/s), io=6983MiB (7322MB), run=300001-300001msec

Disk stats (read/write):
  dm-0: ios=1482775/0, merge=0/0, ticks=340920/0, in_queue=340920, util=100.00%

Disk stats (read/write):
  sda: ios=1483016/0, merge=0/0, ticks=344575/0, in_queue=344576, util=100.00%
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 18:03:45 2024
  read: IOPS=5958, BW=23.3Mi (24.4M)(6983MiB/300001msec)
    slat (usec): min=10, max=18692, avg=221.12, stdev=429.98
    clat (usec): min=3, max=15668, avg=361.20, stdev=441.15
     lat (usec): min=16, max=24007, avg=631.95, stdev=644.84
   bw (  KiB/s): min= 7711, max=28771, per=18.73%, avg=17855.80, stdev=1259.43, samples=1797
   iops        : min= 1927, max= 7192, avg=4463.33, stdev=314.85, samples=1797
  lat (usec)   : 4=0.08%, 10=20.21%, 20=8.67%, 50=1.86%, 100=0.78%
  lat (usec)   : 250=2.92%, 500=47.22%, 750=9.76%, 1000=3.41%
  lat (msec)   : 2=3.40%, 4=1.35%, 10=0.32%, 20=0.01%
  cpu          : usr=5.27%, sys=33.98%, ctx=2058999, majf=0, minf=58
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1787676,0,0,0 short=0,0,0,0 dropped=0,0,0,0