VMs/Results/Suricata/Fio/results_2.txt
hostname=server, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.28, flags=1
<server> write.test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<server> ...
<server> Starting 4 processes
<server> 
write.test: (groupid=0, jobs=1): err= 0: pid=43816: Tue Dec 10 17:56:46 2024
  read: IOPS=1475, BW=5903KiB/s (6044kB/s)(1729MiB/300001msec)
    slat (usec): min=10, max=13459, avg=222.51, stdev=495.98
    clat (usec): min=3, max=15282, avg=366.19, stdev=522.33
     lat (usec): min=16, max=15392, avg=638.34, stdev=752.64
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   23], 40.00th=[  277], 50.00th=[  310], 60.00th=[  347],
     | 70.00th=[  392], 80.00th=[  478], 90.00th=[  693], 95.00th=[ 1029],
     | 99.00th=[ 2606], 99.50th=[ 3490], 99.90th=[ 5800], 99.95th=[ 6652],
     | 99.99th=[ 9110]
   bw (  KiB/s): min= 2312, max= 9402, per=25.30%, avg=5911.75, stdev=1125.59, samples=599
   iops        : min=  578, max= 2350, avg=1477.72, stdev=281.39, samples=599
  lat (usec)   : 4=0.08%, 10=20.04%, 20=8.99%, 50=2.19%, 100=0.80%
  lat (usec)   : 250=1.88%, 500=47.51%, 750=9.81%, 1000=3.50%
  lat (msec)   : 2=3.46%, 4=1.41%, 10=0.34%, 20=0.01%
  cpu          : usr=5.31%, sys=34.31%, ctx=504296, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=442707,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43817: Tue Dec 10 17:56:46 2024
  read: IOPS=1456, BW=5827KiB/s (5967kB/s)(1707MiB/300002msec)
    slat (usec): min=10, max=14724, avg=223.02, stdev=493.43
    clat (usec): min=3, max=16387, avg=371.12, stdev=525.78
     lat (usec): min=16, max=20735, avg=646.40, stdev=754.48
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   23], 40.00th=[  277], 50.00th=[  310], 60.00th=[  347],
     | 70.00th=[  396], 80.00th=[  490], 90.00th=[  717], 95.00th=[ 1057],
     | 99.00th=[ 2671], 99.50th=[ 3556], 99.90th=[ 5669], 99.95th=[ 6718],
     | 99.99th=[ 8979]
   bw (  KiB/s): min= 2512, max= 9061, per=24.98%, avg=5836.62, stdev=1061.51, samples=599
   iops        : min=  628, max= 2265, avg=1458.95, stdev=265.36, samples=599
  lat (usec)   : 4=0.03%, 10=19.61%, 20=9.55%, 50=2.15%, 100=0.86%
  lat (usec)   : 250=1.83%, 500=46.53%, 750=10.29%, 1000=3.74%
  lat (msec)   : 2=3.62%, 4=1.44%, 10=0.34%, 20=0.01%
  cpu          : usr=5.28%, sys=34.07%, ctx=496947, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=437064,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43818: Tue Dec 10 17:56:46 2024
  read: IOPS=1454, BW=5820KiB/s (5959kB/s)(1705MiB/300001msec)
    slat (usec): min=11, max=15037, avg=222.22, stdev=492.21
    clat (usec): min=3, max=20108, avg=372.82, stdev=526.17
     lat (usec): min=16, max=20286, avg=647.13, stdev=756.69
    clat percentiles (usec):
     |  1.00th=[    6],  5.00th=[    7], 10.00th=[    8], 20.00th=[   12],
     | 30.00th=[   25], 40.00th=[  277], 50.00th=[  314], 60.00th=[  347],
     | 70.00th=[  396], 80.00th=[  494], 90.00th=[  717], 95.00th=[ 1057],
     | 99.00th=[ 2671], 99.50th=[ 3556], 99.90th=[ 5669], 99.95th=[ 6652],
     | 99.99th=[ 8979]
   bw (  KiB/s): min= 2832, max= 9488, per=24.93%, avg=5824.39, stdev=1074.70, samples=599
   iops        : min=  708, max= 2372, avg=1455.91, stdev=268.67, samples=599
  lat (usec)   : 4=0.02%, 10=17.95%, 20=10.78%, 50=2.18%, 100=0.94%
  lat (usec)   : 250=1.84%, 500=46.74%, 750=10.39%, 1000=3.75%
  lat (msec)   : 2=3.62%, 4=1.46%, 10=0.34%, 20=0.01%, 50=0.01%
  cpu          : usr=5.28%, sys=33.94%, ctx=494791, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=436475,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43819: Tue Dec 10 17:56:46 2024
  read: IOPS=1453, BW=5815KiB/s (5954kB/s)(1704MiB/300001msec)
    slat (usec): min=11, max=16475, avg=226.25, stdev=502.99
    clat (usec): min=3, max=16211, avg=367.66, stdev=516.64
     lat (usec): min=16, max=17239, avg=648.04, stdev=754.88
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   22], 40.00th=[  273], 50.00th=[  310], 60.00th=[  347],
     | 70.00th=[  392], 80.00th=[  486], 90.00th=[  709], 95.00th=[ 1045],
     | 99.00th=[ 2606], 99.50th=[ 3490], 99.90th=[ 5538], 99.95th=[ 6456],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 2688, max= 8904, per=24.91%, avg=5819.80, stdev=1125.93, samples=599
   iops        : min=  672, max= 2226, avg=1454.74, stdev=281.47, samples=599
  lat (usec)   : 4=0.03%, 10=19.51%, 20=10.00%, 50=1.89%, 100=0.79%
  lat (usec)   : 250=1.96%, 500=46.61%, 750=10.18%, 1000=3.69%
  lat (msec)   : 2=3.58%, 4=1.41%, 10=0.33%, 20=0.01%
  cpu          : usr=5.30%, sys=33.96%, ctx=495526, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=436122,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=22.8MiB/s (23.9MB/s), 5815KiB/s-5903KiB/s (5954kB/s-6044kB/s), io=6845MiB (7178MB), run=300001-300002msec

Disk stats (read/write):
  dm-0: ios=1453776/0, merge=0/0, ticks=337352/0, in_queue=337352, util=100.00%

Disk stats (read/write):
  sda: ios=1453850/0, merge=0/0, ticks=343023/0, in_queue=343023, util=100.00%
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 17:56:46 2024
  read: IOPS=5841, BW=22.8Mi (23.9M)(6845MiB/300002msec)
    slat (usec): min=10, max=16475, avg=223.62, stdev=429.00
    clat (usec): min=3, max=20108, avg=370.68, stdev=452.04
     lat (usec): min=16, max=20735, avg=646.99, stdev=653.00
   bw (  KiB/s): min= 8032, max=27453, per=18.70%, avg=17480.81, stdev=1087.13, samples=1797
   iops        : min= 2008, max= 6863, avg=4369.60, stdev=271.77, samples=1797
  lat (usec)   : 4=0.04%, 10=19.28%, 20=9.83%, 50=2.10%, 100=0.85%
  lat (usec)   : 250=1.88%, 500=46.85%, 750=10.17%, 1000=3.67%
  lat (msec)   : 2=3.57%, 4=1.43%, 10=0.34%, 20=0.01%, 50=0.01%
  cpu          : usr=5.29%, sys=34.07%, ctx=1991560, majf=0, minf=58
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1752368,0,0,0 short=0,0,0,0 dropped=0,0,0,0